project/atropos-go/etcd_concurrent_read-master/master/e4/output/with_expensive_read/cheap_read.log
bench with linearizable range
 0 / 1000 B                                                                                                                                           !   0.00%INFO: 2023/06/09 16:37:40 ccResolverWrapper: sending new addresses to cc: [{localhost:2379 0  <nil>}]
INFO: 2023/06/09 16:37:40 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
INFO: 2023/06/09 16:37:40 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
 1000 / 1000 Booooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 9s

Summary:
  Total:	9.9914 secs.
  Slowest:	0.0089 secs.
  Fastest:	0.0002 secs.
  Average:	0.0004 secs.
  Stddev:	0.0005 secs.
  Requests/sec:	100.0862

Response time histogram:
  0.0002 [1]	|
  0.0010 [925]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.0019 [58]	|∎∎
  0.0028 [6]	|
  0.0037 [6]	|
  0.0046 [2]	|
  0.0054 [1]	|
  0.0063 [0]	|
  0.0072 [0]	|
  0.0081 [0]	|
  0.0089 [1]	|

Latency distribution:
  10% in 0.0002 secs.
  25% in 0.0003 secs.
  50% in 0.0003 secs.
  75% in 0.0004 secs.
  90% in 0.0006 secs.
  95% in 0.0014 secs.
  99% in 0.0029 secs.
  99.9% in 0.0089 secs.